app/controllers/categories_controller.rb

  def show
    @category = Category.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE ("categories"."id" = 1) LIMIT 1

  def edit
    @category = Category.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE ("categories"."id" = 1) LIMIT 1

  def create
    @category = Category.new(params[:category])



    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ('Category One', '2010-12-16 22:37:56.343143', '2010-12-16 22:37:56.343143')

  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])
---
SELECT "categories".* FROM "categories" WHERE ("categories"."id" = 1) LIMIT 1
UPDATE "categories" SET "name" = 'Family Issues', "updated_at" = '2010-12-20 02:16:41.270804' WHERE ("categories"."id" = 1)