app/controllers/prayers_controller.rb

SELECT "prayers".* FROM "prayers" ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "prayers" WHERE ("prayers".user_id = 2)
---
  def index

    @prayers = Prayer.paginate :page => params[:page], :per_page => 10, :order => 'created_at DESC'

SELECT "prayers".* FROM "prayers" WHERE ("prayers"."id" = 1) LIMIT 1
---
  def show
    @prayer = Prayer.find(params[:id])

SELECT "prayers".* FROM "prayers" WHERE ("prayers"."id" = 1) LIMIT 1
---
  def edit
    @prayer = Prayer.find(params[:id])

INSERT INTO "prayers" ("title", "request", "created_at", "updated_at") VALUES ('Hey this is my new prayer', 'Hey this is my request', '2010-12-14 05:10:03.216610', '2010-12-14 05:10:03.216610')
---
  def create
    @prayer  = current_user.prayers.build(params[:prayer])



      if @prayer.save

SELECT "prayers".* FROM "prayers" WHERE ("prayers"."id" = 1) LIMIT 1
UPDATE "prayers" SET "request" = 'This is my new request 2', "category_id" = 2, "updated_at" = '2010-12-17 02:30:46.816432' WHERE ("prayers"."id" = 5)
---
  def update
    @prayer = Prayer.find(params[:id])

      if @prayer.update_attributes(params[:prayer])

SELECT "prayers".* FROM "prayers" WHERE ("prayers"."id" = 1) LIMIT 1
DELETE FROM "prayers" WHERE ("prayers"."id" = 1)
---
  def destroy
    @prayer = Prayer.find(params[:id])
    @prayer.destroy