app/controllers/resources_controller.rb

  def index
    if params[:catid]
      @category = Category.find(params[:catid])
      @resources = Resource.returncat(params[:catid]).paginate :page => params[:page], :per_page => 10, :order => 'created_at DESC'
---
SELECT "categories".* FROM "categories" WHERE ("categories"."id" = 1) LIMIT 1
SELECT "resources".* FROM "resources"

  def show
    @resource = Resource.find(params[:id])
---
SELECT "resources".* FROM "resources" WHERE ("resources"."id" = 1) LIMIT 1

  def edit
    @resource = Resource.find(params[:id])
---
SELECT "resources".* FROM "resources" WHERE ("resources"."id" = 1) LIMIT 1

  def create
    @resource = Resource.new(params[:resource])

    respond_to do |format|
      if @resource.save
---
INSERT INTO "resources" ("title", "description", "url", "category_id", "created_at", "updated_at") VALUES ('Family Issues Website', 'This is a description of a website about family issues', 'http://www.thewebsitee.com', 1, '2010-12-20 05:49:37.731911', '2010-12-20 05:49:37.731911')