app/controllers/users_controller.rb

  def index
    @users = User.find(:all).paginate :page => params[:page], :per_page => 20, :order => 'created_at DESC'
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def edit
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 2) LIMIT 1

  def destroy
    @user = User.find(params[:id])
    if @user.destroy
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 6) LIMIT 1
DELETE FROM "users" WHERE ("users"."id" = 6)