app/views/categories/show.html.erb

SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
            <span class="category">Category: <a href="#"><%= prayer.category.name %></a></span>
            <span class="date">Posted <%= time_ago_in_words(prayer.created_at) %> ago, by <%= prayer.user.firstname %> <%= prayer.user.lastname %></span>